var map = new BMapGL.Map('container'); //创造地图
map.centerAndZoom(new BMapGL.Point(121.46223, 31.233143), 15); //设置地图中心点
map.enableScrollWheelZoom(true); //启用鼠标滚轴缩放

var mapPoints = [
    {x: "31.221975", y: "121.485214"},
    {x: "31.209673", y: "121.45561"},
    {x: "31.240154", y: "121.49108"},
    {x: "31.243223", y: "121.48124"},
    {x: "31.265173", y: "121.52094"},
    {x: "31.235815", y: "121.45961"},
    {x: "31.262098", y: "121.568275"},
    {x: "31.260662", y: "121.52643"},
    {x: "31.242867", y: "121.49023"},
    {x: "31.218384", y: "121.47215"},
    {x: "31.276596", y: "121.47396"},
    {x: "31.237335", y: "121.4714"},
    {x: "31.227758", y: "121.4698"},
    {x: "31.209518", y: "121.44154"},
    {x: "31.229353", y: "121.45463"},
    {x: "31.24119", y: "121.44491"},
    {x: "31.24381", y: "121.46854"},
    {x: "31.217497", y: "121.447754"},
    {x: "31.217909", y: "121.497574"},
    {x: "31.22561", y: "121.49227"},
    {x: "31.241121", y: "121.46362"},
    {x: "31.276144", y: "121.561325"},
    {x: "31.030909", y: "121.78683"},
    {x: "31.267513", y: "121.49024"},
    {x: "30.98755", y: "121.30669"},
    {x: "31.262941", y: "121.489624"},
    {x: "31.244211", y: "121.49412"},
    {x: "31.266336", y: "121.53526"},
    {x: "31.22904", y: "121.47956"},
    {x: "31.2192", y: "121.47272"},
    {x: "31.190865", y: "121.44972"},
    {x: "31.214233", y: "121.4646"},
    {x: "31.227873", y: "121.48032"},
    {x: "31.178427", y: "121.4424"},
    {x: "31.250519", y: "121.49058"},
    {x: "31.277231", y: "121.50605"},
    {x: "31.236797", y: "121.493904"},
    {x: "31.261776", y: "121.53186"},
    {x: "31.246319", y: "121.47801"},
    {x: "31.26847", y: "121.5425"},
    {x: "31.226992", y: "121.43769"},
    {x: "31.16367", y: "121.367714"},
    {x: "31.226265", y: "121.45009"},
    {x: "31.263683", y: "121.488335"},
    {x: "31.22992", y: "121.478004"},
    {x: "31.002434", y: "121.4394"},
    {x: "31.255903", y: "121.48282"},
    {x: "31.26367", y: "121.48411"},
    {x: "31.231483", y: "121.4513"},
    {x: "31.218533", y: "121.47788"},
    {x: "31.2434", y: "121.4815"},
    {x: "31.222422", y: "121.46739"},
    {x: "31.218534", y: "121.489494"},
    {x: "31.240046", y: "121.44909"},
    {x: "31.179523", y: "121.50246"},
    {x: "31.229006", y: "121.46968"},
    {x: "31.236622", y: "121.46123"},
    {x: "31.231058", y: "121.47298"},
    {x: "31.243053", y: "121.49028"},
    {x: "31.030909", y: "121.78683"},
    {x: "31.357163", y: "121.58766"},
    {x: "31.24336", y: "121.48796"},
    {x: "31.24591", y: "121.457275"},
    {x: "31.256798", y: "121.497505"},
    {x: "31.272005", y: "121.491554"},
    {x: "31.2248", y: "121.48376"},
    {x: "31.240046", y: "121.44909"},
    {x: "31.234499", y: "121.46308"},
    {x: "31.261475", y: "121.48163"},
    {x: "31.270657", y: "121.49152"},
    {x: "31.27138", y: "121.52917"},
    {x: "31.240503", y: "121.46721"},
    {x: "31.097286", y: "121.37571"},
    {x: "31.223438", y: "121.49143"},
    {x: "31.232126", y: "121.48605"},
    {x: "31.268446", y: "121.487274"},
    {x: "31.245274", y: "121.49428"},
    {x: "31.233143", y: "121.46223"},
    {x: "31.224117", y: "121.4732"},
    {x: "31.238802", y: "121.441956"},
    {x: "31.265867", y: "121.5147"},
    {x: "31.22546", y: "121.476746"},
    {x: "31.179523", y: "121.50246"},
    {x: "31.112064", y: "121.06141"}
];
var info_buildingName = ['任耐、王乃坚旧居', '夏衍旧居', '《真话报》社遗址', '全国总工会印刷所遗址', '中共杨树浦部委机关遗址', '中共中央秘密印刷厂', '读书生活出版社', '圣工小学旧址', '时代出版社', '“红色教授”钱亦石工作地', '楚图南旧居', '瞿秋白旧居', '中国国民党临时行动委员会印刷机关', '卜万苍旧居', '郁达夫旧居', '孤军营遗址', '文明印务局遗址', '潘汉年旧居', '上海留法勤工俭学预备科旧址', '《向导》周刊编辑部遗址', '中共中央秘密印刷厂', '王孝和旧居', '惠知小学遗址', '鲁迅1930年避难处', '“新时代丛书”社暨李汉俊旧居', '上海工人第三次武装起义罗亦农办公室', '上海中国职业妇女俱乐部旧址', '中共沪东重工业委员会联络点遗址', '董健吾旧居', '徐懋庸旧居', '徐鸿、柳湜旧居', '萧军旧居', '赴法学生上海会集所遗址', '曹家花园旧址', '中兴印刷厂旧址', '中共大连坊秘密排字厂遗址', '《联合日报》社', '中共中央沪东印刷厂遗址', '四行仓库抗日纪念地', '工余义务夜校', '蔡元培旧居', '七号桥碉堡旧址', '上海人民广播电台旧址', '陶晶孙旧居', '李白贝勒路电台遗址', '中共沪东机器业联络点遗址', '北火车站“六二三”集会地遗址', '巴金旧居', '华东模范中学', '第一国际难民收容所旧址', '上海印刷工会', '许广平旧居', '上海公共体育场旧址', '1948年民革上海临时分会暨叶尚文旧居', '江浙留法同学会', '1940年新四军上海办事处遗址', '中共中央秘密联络点暨罗亦农被捕处遗址', '中联广播电台遗址', '“爱用国货，抵制美货”委员会成立大会旧址', '沪东工人纠察队秘密军训处遗址', '黄慕兰旧居', '神州职业夜中学', '中国国民党临时行动委员会组织委员会机关', '杨匏安旧居及其被捕处', '理查德·左尔格旧居', '李书城、李汉俊旧居暨《星期评论》编辑部遗址', '佛教净业妇孺难民收容所遗址', '《新华日报》驻沪办事处', '国华印刷所遗址', '沙汀旧居', '浦阳小学旧址', '上海工部局华员总会难民收容所遗址', '闵行区烈士陵园', '西门书店遗址', '黄金大戏院暨1939年中共地下党领导的上海市职业界联合义卖公演处遗址', '冯雪峰旧居', '中共地下党秘密联络点——鼎元钱庄', '荣家老宅', '孙中山旧居', '棚户民校遗址', '中共明华坊印刷厂遗址', '中国农工民主党驻沪秘密办事处旧址', '瞿白音旧居', '陆凤翔旧居'];
var info_address = ['顺昌路', '乌鲁木齐南路178号2号楼', '九江路山东中路路口', '浙江中路天潼路之间的北京东路北侧', '长阳路荆州路路口一带', '北京西路', '吴江路', '福禄街195号', '南京东路', '瑞金二路', '西宝兴路', '南京西路646弄一带', '瑞金一路', '淮海中路2006弄', '常德路81弄', '余姚路321弄一带', '新闸路大田路西北角', '武康路99号', '陆家浜路918号', '复兴东路1047弄3号', '泰兴路', '杨树浦路2800号内', '惠民路荆州路一带', '四川北路1881弄', '兴业路76、78号', '四川北路', '南京东路114-142号', '盐山路近齐齐哈尔路北侧', '淮海中路358弄21号', '瑞金二路129弄106号', '辛耕路天钥桥路', '襄阳南路351号', '兴安路', '漕溪路203号漕溪公园内', '天潼路478弄12号', '唐山路大连路路口', '延安东路', '扬州路346弄爱民坊', '光复路1号', '平凉路新华里1298弄23号', '愚园路884号', '漕宝路2005号', '延安西路129号', '北四川路', '黄陂南路148号', '平凉路大连路路口', '天目东路（上海铁路博物馆）', '宝山路', '胶州路15号', '重庆南路227号', '芝罘路', '淮海中路927弄64号', '方斜路515号', '常德路', '淮海中路', '巨鹿路瑞金一路路口', '北京西路1060弄', '大沽路延安公园北端', '南京东路328号', '惠民路419弄', '华山路', '天津路', '淮安路', '东余杭路', '山阴路145弄2号', '自忠路三益里17号', '常德路', '南京西路', '宝昌路临山路路口', '山阴路57号', '江浦路969弄', '石门二路', '临春路388号', '中华路盐城路路口', '金陵中路1号', '横浜路35弄11号', '四川中路滇池路路口', '陕西北路186号', '南昌路59号', '余姚路487弄19号', '霍山路保定路路口东南侧', '南昌路56号', '淮海中路', '朱家角镇胜利街239弄胜利新村内'];

function addClickHandler(content, marker, options) {
            marker.addEventListener("click", function (e) { //监听单击事件
                openInfo(content, e, options)
        }
    );
}

function openInfo(content, e, options) {
    var p = e.target;
    var point = new BMapGL.Point(p.getPosition().lng, p.getPosition().lat);
    var infoWindow = new BMapGL.InfoWindow(content, options);  // 创建信息窗口对象
    map.openInfoWindow(infoWindow, point); //开启信息窗口
}

var dist = new BMapGL.DistrictLayer({
    name: '(上海市)',
    fillColor: '#96adf1',
    fillOpacity: 0.25
});
map.addDistrictLayer(dist);

for (var i = 0; i < mapPoints.length; i++) {
    var points = new BMapGL.Point(mapPoints[i].y, mapPoints[i].x)
    var markers = new BMapGL.Marker(points);
    map.addOverlay(markers); //在地图上标记

    var opts = {
        position: points,
        width: 100,
        height: 50,
        title: info_buildingName[i]//配置info box
    }
    addClickHandler(info_address[i],markers,opts); //设置在点击时打开
}